docs (docs): update readme file with new shield badges
